{
  "backend/main.mo": "Defines the main backend actor with storage mixins, access control, cruise deals, itineraries, bookings, reviews, alerts, branding settings, and other state maps.",
  "backend/migration.mo": "Provides a migration function that adds a backendVersion field to the actor state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten one-line summaries for numerous frontend components and files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode using OKLCH color values.",
  "frontend/index.html": "Minimal HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app logic that detects share links and renders either the shared itinerary page or the full homepage layout with dialogs and alerts.",
  "frontend/src/components/AdminAlertToast.tsx": "Displays toast notifications for new unviewed admin alerts when the caller is an admin.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog showing alerts, bookings, logos, and branding tabs with automatic alert viewing updates.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Admin settings dialog showing user role, principal ID, backend status, and allowing admin role assignment.",
  "frontend/src/components/AppStatusLiveLinkSection.tsx": "Displays the app’s live URL with copy/open actions and shows backend diagnostics like version and timestamp.",
  "frontend/src/components/BookingModal.tsx": "Modal for selecting cabins and submitting a booking for a cruise itinerary, including cost calculation.",
  "frontend/src/components/CruiseCard.tsx": "Displays cruise deal details with destination imagery, favorite toggling, and itinerary viewing.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface to add, edit, preview, and delete cruise line logos with image upload support.",
  "frontend/src/components/CruiseLinePartners.tsx": "Shows a grid of cruise line partner logos or skeletons while loading.",
  "frontend/src/components/FavoritesDialog.tsx": "Displays a dialog listing the user's favorite cruise deals with loading states and empty-state messaging.",
  "frontend/src/components/FeaturedDeals.tsx": "Fetches and shows featured cruise deals in a carousel with auto-scroll, loading skeletons, and error handling.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social icons, and copyright info.",
  "frontend/src/components/Header.tsx": "Implements the main site header with navigation, authentication controls, admin actions, and dialogs for favorites and bookings.",
  "frontend/src/components/Hero.tsx": "Shows the homepage hero banner with background image, promotional text, action buttons, and quick stats.",
  "frontend/src/components/ItineraryDialog.tsx": "Displays detailed cruise itinerary information with tabs, reviews, booking, sharing, and PDF export options.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter their name and saves their profile information.",
  "frontend/src/components/ReviewSection.tsx": "Renders and manages cruise reviews, including creating, editing, deleting, and displaying user reviews with star ratings.",
  "frontend/src/components/SearchSection.tsx": "Provides cruise search and filtering UI, including query input, filter controls, and displaying matched cruise results.",
  "frontend/src/components/SharedItineraryPage.tsx": "Displays a shareable itinerary page with branding, images, and details, handling loading, errors, and expired links.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Offers a settings form for updating shared page branding fields and saving or resetting branding configurations.",
  "frontend/src/components/UserBookingsDialog.tsx": "Shows a dialog listing the user's bookings with status, itinerary details, and loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login flow, stored identity loading, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating cruise, itinerary, and user data via an actor, integrating identity and caching behaviors.",
  "frontend/src/index.css": "Sets global Tailwind CSS layers and defines extensive color variables and utility classes for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/colorValidation.ts": "Validates color strings and provides helpers for applying safe CSS color styles with fallbacks.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable HTML-based PDF page for an itinerary by opening a styled print window.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Merges branding settings with default values for shared itinerary pages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including hash-based routing support and session storage fallback.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color palettes, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, known issues, and implemented features related to live app links and deployment diagnostics for the 'Next Time Vacations' project."
}