{
  "backend/main.mo": "Defines backend actor with storage mixins, access control, branding settings, and data models for cruises, itineraries, bookings, reviews, alerts, and shareable links.",
  "feature_evidence.json": "Lists feature evidence entries linking homepage hero image requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides summarized descriptions of numerous frontend components, hooks, and configuration files for build reference.",
  "frontend/index.css": "Defines Tailwind base, components, and utilities with extensive CSS variable theming for light and dark modes.",
  "frontend/index.html": "Minimal HTML bootstrap file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling share-link routing and rendering either the shared itinerary page or the standard homepage layout.",
  "frontend/src/components/AdminAlertToast.tsx": "Displays toast notifications for new admin alerts when the caller is an admin.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard modal showing alerts, bookings, logo management, and branding settings with tabbed navigation.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Admin settings dialog that displays user role, principal ID, app diagnostics, and allows assigning admin privileges.",
  "frontend/src/components/AppStatusLiveLinkSection.tsx": "Shows the live app URL, copy/open controls, and backend diagnostics including version and timestamp.",
  "frontend/src/components/BookingModal.tsx": "Booking modal allowing users to select cabins, view cruise details, calculate total cost, and submit a booking.",
  "frontend/src/components/CruiseCard.tsx": "Card component displaying cruise deal details with favorite toggling and itinerary modal support.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface for adding, editing, previewing, and deleting cruise line logos with image upload support.",
  "frontend/src/components/CruiseLinePartners.tsx": "Section displaying cruise line partner logos or loading placeholders, with fallback when no logos exist.",
  "frontend/src/components/FavoritesDialog.tsx": "Displays a dialog listing the user's favorite cruise deals, showing skeletons while loading and a fallback message if none exist.",
  "frontend/src/components/FeaturedDeals.tsx": "Fetches and displays featured cruise deals in an auto-advancing carousel with loading and error states.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, destination links, social media icons, and a copyright note.",
  "frontend/src/components/Header.tsx": "Provides the site header with navigation, authentication controls, and dialogs for favorites, bookings, and admin tools.",
  "frontend/src/components/Hero.tsx": "Shows the full-screen hero section with a preloaded background image, marketing text, and action buttons.",
  "frontend/src/components/ItineraryDialog.tsx": "Displays detailed cruise itinerary info with tabs, reviews, booking actions, sharing, and PDF generation.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts authenticated users without a profile to enter their name and saves it via an API call.",
  "frontend/src/components/ReviewSection.tsx": "Handles displaying, creating, editing, and deleting cruise reviews with authentication and star rating UI.",
  "frontend/src/components/SearchSection.tsx": "Implements search and filter UI for cruises, building backend-safe filters and showing matching results or all deals.",
  "frontend/src/components/SharedItineraryPage.tsx": "Displays a read-only shared itinerary page with branding, handling loading, errors, and custom styling.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Provides a settings form for editing and resetting shared page branding, syncing with backend settings.",
  "frontend/src/components/UserBookingsDialog.tsx": "Shows a dialog listing a user's bookings with status, dates, and itinerary details, including loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value, updating only after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks to manage Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating cruise-related backend data with actor-based authentication.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light and dark themes, including ocean and sunset color palettes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/colorValidation.ts": "Provides helpers to validate CSS color strings and safely apply color styles or fallbacks.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable PDF-style itinerary by opening a new window and injecting styled HTML content.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Defines default branding values and merges backend branding settings with defaults.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color palettes, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, issues, required images, and feature requests related to maintaining a persistent full-screen cruise ship hero image on the homepage."
}