{
  "backend/main.mo": "Main Motoko actor defining storage, types, authorization mixins, and state for cruises, itineraries, bookings, reviews, alerts, branding settings, and shareable links.",
  "backend/migration.mo": "Migration module defining old/new actor data structures and logic for upgrading stored maps and records across versions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of various frontend components and hooks.",
  "frontend/index.css": "Global Tailwind base styles and CSS variables for light/dark themes using OKLCH color values.",
  "frontend/index.html": "HTML entry point defining the root element and loading the main React script.",
  "frontend/src/App.tsx": "Root React component initializing providers, routing logic for shared itinerary pages, and rendering main UI sections.",
  "frontend/src/components/AdminAlertToast.tsx": "Component that detects new admin alerts and displays toast notifications for unviewed booking alerts.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog with tabs for alerts, bookings, logo management, and branding, loading data and marking alerts as viewed.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Dialog for viewing current user role and assigning admin privileges to the logged-in identity.",
  "frontend/src/components/BookingModal.tsx": "Booking modal allowing users to select cabins, calculate totals, and submit a booking for an itinerary.",
  "frontend/src/components/CruiseCard.tsx": "Cruise deal card showing itinerary details, destination image, and favorite toggling with identity checks.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface for adding, editing, previewing, and deleting cruise line logos with file upload support.",
  "frontend/src/components/CruiseLinePartners.tsx": "Section displaying partner cruise line logos with loading skeletons and graceful empty states.",
  "frontend/src/components/FavoritesDialog.tsx": "Displays a dialog listing the user's favorite cruise deals, showing loading skeletons or an empty state when needed.",
  "frontend/src/components/FeaturedDeals.tsx": "Fetches and displays featured cruise deals in an auto-scrolling carousel with loading and error states.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social icons, and contact info.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, authentication handling, admin controls, and dialogs for favorites and bookings.",
  "frontend/src/components/Hero.tsx": "Shows the homepage hero section with a background image, marketing text, action buttons, and stats.",
  "frontend/src/components/ItineraryDialog.tsx": "Displays detailed cruise itinerary information with reviews, booking options, sharing, and PDF generation.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter and save their profile name before continuing.",
  "frontend/src/components/ReviewSection.tsx": "Displays and manages cruise reviews, including creating, editing, deleting, and listing reviews with star ratings and authentication checks.",
  "frontend/src/components/SearchSection.tsx": "Provides search and filter UI for cruises, including text search, dropdown filters, sliders, and rendering filtered cruise results.",
  "frontend/src/components/SharedItineraryPage.tsx": "Renders a public itinerary page using shareable links, applying branding settings and showing itinerary details, images, and sections.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Offers a settings form for updating and resetting shared page branding values like colors, logo, and text with backend persistence.",
  "frontend/src/components/UserBookingsDialog.tsx": "Shows a modal listing a user’s bookings with status, dates, and itinerary info, including loading states and detailed booking cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading identities, login flow, and state flags.",
  "frontend/src/hooks/useQueries.ts": "Wraps actor-based backend calls with React Query hooks for fetching and mutating cruise data, itineraries, user profiles, and related entities.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive custom CSS variables for light and dark themes, including ocean and sunset color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/colorValidation.ts": "Validates and sanitizes color strings, providing safe fallbacks and style application helpers.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable PDF-style itinerary by opening a new window and injecting styled HTML content.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Merges fetched branding settings with defaults for shared itinerary pages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, plugins, content paths, and extensive custom color/theme extensions.",
  "project_state.json": "Stores project metadata, architectural notes, known issues, and a list of existing feature requirements with versions."
}