{
  "backend/main.mo": "Main canister actor defining cruise deals, itineraries, bookings, reviews, user profiles, branding settings, alerts, logos, and shareable links with access control, storage, and invite-link modules.",
  "backend/migration.mo": "Migration module replicating all backend types and returning the previous actor state unchanged during upgrades.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend components, hooks, styles, and configuration files.",
  "frontend/index.css": "Global Tailwind-based style definitions including CSS variables for light and dark themes and base layout rules.",
  "frontend/index.html": "HTML entry point setting up the root element, metadata, and preloading the default hero image.",
  "frontend/src/App.tsx": "Main React component routing between shared itinerary view and the standard app layout with hero, deals, partners, and dialogs.",
  "frontend/src/components/AdminAlertToast.tsx": "Component that listens for new unviewed admin alerts and displays them as toast notifications for admin users.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog with tabs for alerts, bookings, logos, branding, and hero settings, fetching data and marking alerts as viewed. Displays lists with loading states and integrates management subcomponents.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Admin settings dialog showing user role, principal ID, live link section, and controls for assigning admin privileges. Uses identity hooks and mutation to update roles with status feedback.",
  "frontend/src/components/AppStatusLiveLinkSection.tsx": "Component showing the live app URL with copy/open actions and backend diagnostics info. Fetches diagnostics and displays version, timestamp, and errors.",
  "frontend/src/components/BookingModal.tsx": "Booking modal allowing users to select cabins, view totals, and submit a booking for an itinerary. Handles cabin selection, cost calculation, and booking mutation with success/error toasts.",
  "frontend/src/components/CruiseCard.tsx": "Cruise deal card showing image, details, favorite toggle, and itinerary modal. Integrates favorites mutations and dynamically selects destination images.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin UI for listing, adding, editing, and deleting cruise line logos with image upload and preview.",
  "frontend/src/components/CruiseLinePartners.tsx": "Displays grid of cruise line partner logos with loading skeletons and fallback message if none exist.",
  "frontend/src/components/FavoritesDialog.tsx": "Dialog showing user's favorite cruise deals, loading states, and empty-state messaging.",
  "frontend/src/components/FeaturedDeals.tsx": "Fetches and displays featured cruise deals in an auto-scrolling carousel with error and loading handling.",
  "frontend/src/components/Footer.tsx": "Footer with company branding, navigation links, destination links, social icons, and copyright.",
  "frontend/src/components/Header.tsx": "Top navigation bar with authentication, admin options, dialogs, mobile menu, and navigation links.",
  "frontend/src/components/Hero.tsx": "Hero section with dynamic hero image loading, fallback logic, error display, and animated background image.",
  "frontend/src/components/HomepageHeroImageManagement.tsx": "Component for uploading, validating, previewing, saving, and resetting the homepage hero image.",
  "frontend/src/components/ItineraryDialog.tsx": "Displays detailed cruise itinerary info with tabs, booking, sharing, and PDF export options.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter and save their name for profile creation.",
  "frontend/src/components/ReviewSection.tsx": "Fetches, displays, submits, edits, and deletes cruise reviews with rating and comment support.",
  "frontend/src/components/SearchSection.tsx": "Provides search and filter controls to query cruises with debounced input and dynamic filters.",
  "frontend/src/components/SharedItineraryPage.tsx": "Renders a public itinerary page from a shareable link with branding, details, and error handling.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "React component for viewing, editing, and resetting shared page branding settings with form state and save/reset actions.",
  "frontend/src/components/UserBookingsDialog.tsx": "Dialog component that displays a user's bookings with itinerary details, status badges, and loading states.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes related queries on identity change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook returning a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as deals, itineraries, profiles, bookings, and branding settings.",
  "frontend/src/index.css": "Tailwind setup defining global CSS variables and theme palettes for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/utils/colorValidation.ts": "Provides functions to validate CSS color strings and apply safe color styles with fallbacks.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable itinerary PDF by opening a new window and injecting styled HTML content.",
  "frontend/src/utils/publicAssetUrl.ts": "Resolves public asset URLs with optional fallbacks for different environments.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Defines default branding and merges backend-provided branding settings with those defaults.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter parsing, session persistence, and hash cleanup utilities.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, plugins, and content paths.",
  "project_state.json": "Describes the project's state, issues, and feature requests for hero image management."
}