{
  "backend/main.mo": "Defines the main backend actor with cruise deals, itineraries, bookings, reviews, user profiles, share links, branding settings, and admin alerts with storage and authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend components and files.",
  "frontend/index.css": "Configures Tailwind base styles and color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry file loading the React app and preloading the hero image.",
  "frontend/src/App.tsx": "Main React component that switches between shared itinerary view and the full app UI based on share link detection.",
  "frontend/src/components/AdminAlertToast.tsx": "Shows toast notifications to admins for new unviewed booking alerts.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog with tabs for alerts, bookings, logo management, and branding settings.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Admin settings dialog for viewing user role, assigning admin privileges, and showing app status and live link.",
  "frontend/src/components/AppStatusLiveLinkSection.tsx": "Displays the app's live URL with copy/open actions and shows backend diagnostics including version and timestamp.",
  "frontend/src/components/BookingModal.tsx": "Provides a booking dialog allowing users to select cabins, calculate total cost, and submit a trip booking.",
  "frontend/src/components/CruiseCard.tsx": "Renders a cruise deal card with images, details, favorites handling, and itinerary popup support.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface to add, update, preview, and delete cruise line logos with image upload validation.",
  "frontend/src/components/CruiseLinePartners.tsx": "Displays a grid of cruise line partner logos with loading skeletons and fallback messaging.",
  "frontend/src/components/FavoritesDialog.tsx": "Shows a dialog listing the user's favorite cruise deals or a message when none are saved.",
  "frontend/src/components/FeaturedDeals.tsx": "Fetches and displays featured cruise deals in an auto-scrolling carousel with loading and error states.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social icons, and a copyright notice.",
  "frontend/src/components/Header.tsx": "Implements the main header with navigation, login/logout handling, and access to user and admin dialogs.",
  "frontend/src/components/Hero.tsx": "Displays the homepage hero section with a background image, error fallback, headline text, and action buttons.",
  "frontend/src/components/ItineraryDialog.tsx": "Shows detailed cruise itinerary information with tabs, reviews, booking, sharing, and PDF export features.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts newly authenticated users to enter their name and saves their profile.",
  "frontend/src/components/ReviewSection.tsx": "Manages displaying, submitting, editing, and deleting cruise reviews with star ratings.",
  "frontend/src/components/SearchSection.tsx": "Provides a cruise search UI with debounced text input, filter controls, and results from query hooks.",
  "frontend/src/components/SharedItineraryPage.tsx": "Displays a public itinerary page using shareable link data and branding settings, handling loading and error states.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Renders a settings panel to edit and reset branding fields, syncing with backend settings.",
  "frontend/src/components/UserBookingsDialog.tsx": "Shows a dialog listing the user's bookings with status, dates, and linked itinerary info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity changes, invalidating related queries when updated.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a hook returning a debounced version of a given value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, exposing identity state, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating cruise-related data, with helpers to normalize and key search filters.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes including ocean and sunset color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/colorValidation.ts": "Validates CSS color strings and offers helpers to safely apply colors or fallbacks.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable PDF-like HTML view for an itinerary by opening a new window with styled content.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Provides default branding values and a helper to merge backend branding settings with defaults.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including custom color variables, plugins, and responsive container settings.",
  "project_state.json": "Defines project metadata and pending feature requests focused on adding, processing, and displaying a hero image with proper fallback and preload behavior."
}