{
  "backend/main.mo": "Defines the backend canister with storage mixins, access control, invite links, data models for cruises, itineraries, bookings, alerts, branding, and in‑memory maps for all entities.",
  "feature_evidence.json": "Feature evidence report linking a hero-section layout update to the source file and related components with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and main functionality of various frontend React components, hooks, and config files.",
  "frontend/index.css": "Defines CSS variables and Tailwind base styles for light/dark themes using OKLCH color values.",
  "frontend/index.html": "Root HTML file that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app that detects share links and conditionally renders either the shared itinerary page or the full home layout with global theming and dialogs.",
  "frontend/src/components/AdminAlertToast.tsx": "Displays toast notifications for admins when new unviewed booking alerts arrive.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog showing alerts, bookings, cruise line logos, and branding settings with tabbed navigation and auto‑marking of viewed alerts.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Dialog for viewing current user role, principal ID, and assigning admin privileges, plus displaying app status and live link info.",
  "frontend/src/components/AppStatusLiveLinkSection.tsx": "Displays the app's live URL with copy and open actions and shows backend diagnostics including version and last update time.",
  "frontend/src/components/BookingModal.tsx": "Provides a dialog for selecting cabins and submitting a cruise booking, calculating totals and handling form state.",
  "frontend/src/components/CruiseCard.tsx": "Renders a cruise deal card with images, details, itinerary access, and favorite toggling.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface to add, edit, preview, and delete cruise line logos with image upload support.",
  "frontend/src/components/CruiseLinePartners.tsx": "Displays partner cruise line logos in a responsive grid with loading and empty states.",
  "frontend/src/components/FavoritesDialog.tsx": "Shows a dialog listing the user's favorited cruise deals with loading and empty handling.",
  "frontend/src/components/FeaturedDeals.tsx": "Fetches and displays featured cruise deals in an auto-advancing carousel with error and loading states.",
  "frontend/src/components/Footer.tsx": "Renders a site footer with logo, links, social icons, and a copyright note.",
  "frontend/src/components/Header.tsx": "Provides the site header with navigation, authentication controls, admin tools, and mobile menu handling.",
  "frontend/src/components/Hero.tsx": "Displays the homepage hero section with background images, marketing text, and action buttons.",
  "frontend/src/components/ItineraryDialog.tsx": "Shows detailed cruise itinerary info with tabs, reviews, booking, sharing, and PDF generation features.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts authenticated users without a profile to enter their name and saves it.",
  "frontend/src/components/ReviewSection.tsx": "Manages viewing, creating, editing, and deleting cruise reviews with rating and form handling.",
  "frontend/src/components/SearchSection.tsx": "Implements a cruise search UI with debounced text input, filter controls, and dynamic query results from backend hooks.",
  "frontend/src/components/SharedItineraryPage.tsx": "Displays a shared itinerary with branding, handling loading, invalid links, and rendering itinerary details with styled sections.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Provides a form to edit and reset shared page branding settings, syncing with backend and showing loading states.",
  "frontend/src/components/UserBookingsDialog.tsx": "Shows a dialog listing user bookings with status, dates, and itinerary info, including loading skeletons and per-booking cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating cruise deals, itineraries, and filtered searches using an actor API.",
  "frontend/src/index.css": "Defines Tailwind base layers and extensive OKLCH theme variables including light, dark, ocean, and sunset palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/colorValidation.ts": "Utility functions to validate CSS color strings and safely apply colors or fallbacks.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable PDF-like window for itinerary details using custom-styled HTML.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Merges backend branding settings with default values for shared itinerary pages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with OKLCH-based color system, ocean/sunset palettes, and plugin integrations.",
  "project_state.json": "Describes project metadata, existing features, and pending feature requests for Next Time Vacations."
}