{
  "backend/main.mo": "Defines the main backend canister with storage mixins, authorization, cruise data models, bookings, reviews, alerts, branding settings, and in-memory maps for all entities.",
  "feature_evidence.json": "Lists features, related files, components, tests, and confidence levels for build and deployment evidence tracking.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend source files describing their roles and behaviors.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component that detects share links and renders either the shared itinerary view or the standard home layout.",
  "frontend/src/components/AdminAlertToast.tsx": "Displays toast notifications for unviewed admin booking alerts when the user is an admin.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog showing alerts, bookings, cruise line logos, and branding settings with automatic alert marking.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Admin dialog showing current user role, principal ID, and allows assigning admin privileges using role mutation hooks.",
  "frontend/src/components/BookingModal.tsx": "Booking modal letting users select cabins, calculate total cost, and submit a booking for a cruise itinerary.",
  "frontend/src/components/CruiseCard.tsx": "Displays a cruise deal card with images, details, itinerary access, and favorite management.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface to add, edit, preview, and delete cruise line logos with image upload handling.",
  "frontend/src/components/CruiseLinePartners.tsx": "Public section that displays all cruise line partner logos or loading placeholders.",
  "frontend/src/components/FavoritesDialog.tsx": "Dialog listing a user's favorite cruise deals with loading states and fallback messaging.",
  "frontend/src/components/FeaturedDeals.tsx": "Featured deals section showing carousel of highlighted cruise deals with auto-scroll and error handling.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links, social icons, branding, and a copyright note.",
  "frontend/src/components/Header.tsx": "Provides the sticky site header with navigation, auth handling, admin tools, and dialogs for favorites and bookings.",
  "frontend/src/components/Hero.tsx": "Displays the homepage hero section with a background image, headline, action buttons, and feature highlights.",
  "frontend/src/components/ItineraryDialog.tsx": "Shows a detailed cruise itinerary dialog with reviews, booking, sharing, and PDF generation features.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter their name and saves their profile.",
  "frontend/src/components/ReviewSection.tsx": "Manages viewing, submitting, editing, and deleting cruise reviews with rating controls and authentication checks.",
  "frontend/src/components/SearchSection.tsx": "Search UI for cruises with text input, filters, and result listing using cruise deals data and query hooks.",
  "frontend/src/components/SharedItineraryPage.tsx": "Displays a shared itinerary with branding, loading/error states, and itinerary details loaded via queries.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Admin UI for viewing, editing, and resetting shared page branding settings via queries and mutations.",
  "frontend/src/components/UserBookingsDialog.tsx": "Dialog showing a user's bookings with status, itinerary info, and loading states using query data.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, stored identities, and provider setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating cruise deals, itineraries, user profiles, and filtered searches using an actor API.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive custom CSS variables for theming, including ocean and sunset color palettes and dark mode overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, loading global styles.",
  "frontend/src/utils/colorValidation.ts": "Validates color strings, returns safe fallbacks, and builds styled color objects with basic CSS format checks.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable HTML-based PDF window for an itinerary with styled sections and error handling.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Provides default branding values and merges fetched branding settings with those defaults.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, clearing, and managing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theming with custom OKLCH-based colors, components, and plugins.",
  "project_state.json": "JSON metadata describing project state, features, issues, and configuration information."
}