{
  "backend/main.mo": "Main Motoko canister defining cruise deals, itineraries, bookings, reviews, branding, alerts, and shareable link data structures with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component setting up providers, routing for shared itineraries, and rendering the full UI layout.",
  "frontend/src/components/AdminAlertToast.tsx": "Component that shows toast notifications for new unviewed admin booking alerts.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog showing alerts, bookings, logo management, and branding settings with tabs and data loading.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Dialog for viewing user role, principal ID, and assigning admin privileges.",
  "frontend/src/components/BookingModal.tsx": "Modal for selecting cabins, calculating total cost, and submitting a cruise booking.",
  "frontend/src/components/CruiseCard.tsx": "Displays cruise deal details with images, favorites support, and itinerary modal access.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface to add, edit, preview, and delete cruise line logos.",
  "frontend/src/components/CruiseLinePartners.tsx": "Shows partner cruise line logos with loading placeholders and fallback messaging.",
  "frontend/src/components/FavoritesDialog.tsx": "Dialog listing a user's favorited cruise deals or showing empty state placeholders.",
  "frontend/src/components/FeaturedDeals.tsx": "Section showing featured cruise deals in an auto-scrolling carousel with error and loading states.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social links, and a dynamic copyright section.",
  "frontend/src/components/Header.tsx": "Implements the main header with navigation, authentication handling, admin tools, and dialogs for favorites and bookings.",
  "frontend/src/components/Hero.tsx": "Displays the homepage hero section with promotional text, action buttons, and feature highlights.",
  "frontend/src/components/ItineraryDialog.tsx": "Shows a detailed cruise itinerary in a dialog with tabs, reviews, booking, sharing, and PDF generation features.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter and save their profile name.",
  "frontend/src/components/ReviewSection.tsx": "Handles displaying, creating, editing, and deleting cruise reviews with star ratings.",
  "frontend/src/components/SearchSection.tsx": "Search UI for cruises with text search, filters, and results display using query hooks.",
  "frontend/src/components/SharedItineraryPage.tsx": "Displays a shared itinerary with branding, images, ship specs, and error/loading states.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Admin tab for editing and resetting shared page branding settings with form state and API updates.",
  "frontend/src/components/UserBookingsDialog.tsx": "Dialog showing a user's bookings with status, dates, and itinerary details using query hooks.",
  "frontend/src/config/footerSocialLinks.ts": "Exports preset social media profile links for the site footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity loading, and related state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating cruise deals, itineraries, user profiles, and related data via an actor API.",
  "frontend/src/index.css": "Configures Tailwind base styles and extensive CSS variables for themes, including ocean and sunset color palettes and dark mode.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/colorValidation.ts": "Provides utilities to validate color strings and return safe color styles or fallbacks.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable PDF-like itinerary by opening a new window and injecting styled HTML content.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Defines default branding and merges backend branding settings with fallback values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and managing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes with custom color variables, ocean/sunset palettes, and plugin integrations.",
  "project_state.json": "Defines project metadata, architectural notes, known issues, and a list of existing features with their IDs, descriptions, and requirement links. Primarily serves as the canonical state and feature registry for the project."
}