{
  "backend/main.mo": "Defines core backend actor with cruise deals, itineraries, bookings, reviews, alerts, branding settings, and access control state.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Lists summarized descriptions of all major frontend components and hooks.",
  "frontend/index.css": "Global Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app.",
  "frontend/src/App.tsx": "Root React component configuring theme, query client, layout, shared itinerary routing, and global dialogs/toasts.",
  "frontend/src/components/AdminAlertToast.tsx": "Displays toast notifications for new unviewed admin booking alerts.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog showing alerts, bookings, logo management, and branding settings with tabbed navigation.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Dialog for viewing caller role, principal ID, and assigning admin privileges.",
  "frontend/src/components/BookingModal.tsx": "Modal for selecting cabins and submitting a booking, including cost calculation and mutation handling.",
  "frontend/src/components/CruiseCard.tsx": "Displays a cruise deal card with image, details, favorite toggle, and itinerary dialog support.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface to add, edit, preview, and delete cruise line logos using file uploads and queries.",
  "frontend/src/components/CruiseLinePartners.tsx": "Shows a grid of cruise line partner logos or skeletons while loading.",
  "frontend/src/components/FavoritesDialog.tsx": "Dialog listing the user’s favorite cruise deals with loading states and fallback messaging.",
  "frontend/src/components/FeaturedDeals.tsx": "Fetches and displays featured cruise deals in an auto‑scrolling carousel with loading and error states.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social links, and contact info.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, user auth actions, admin controls, and dialogs for favorites, bookings, and admin tools.",
  "frontend/src/components/Hero.tsx": "Full‑width hero section with background image, marketing text, action buttons, and cruise statistics.",
  "frontend/src/components/ItineraryDialog.tsx": "Dialog showing detailed cruise itinerary with tabs, reviews, booking, sharing, and PDF generation options.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts authenticated users without a profile to enter their name and saves it via backend mutation.",
  "frontend/src/components/ReviewSection.tsx": "Displays cruise reviews and allows authenticated users to create, edit, and delete their own reviews.",
  "frontend/src/components/SearchSection.tsx": "Search and filter interface for cruise deals with query input, filters, sliders, and result listing.",
  "frontend/src/components/SharedItineraryPage.tsx": "Displays a public itinerary view with branding, images, and ship info, handling loading and invalid-link states.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Provides a settings form for customizing shared page branding and saving or resetting branding values.",
  "frontend/src/components/UserBookingsDialog.tsx": "Shows a dialog listing the user's bookings with status, dates, and itinerary details, including loading and empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating cruise deals, itineraries, user data, bookings, reviews, and branding settings using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH CSS variables for light/dark themes plus custom ocean/sunset palettes and utility classes.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, loading global styles.",
  "frontend/src/utils/colorValidation.ts": "Provides functions to validate color strings and safely apply them to styles or fallback classes.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable PDF-style HTML window for an itinerary with structured styling.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Defines default branding and merges stored branding settings with fallback values.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config extending theming with OKLCH CSS variable–based colors, plugins, and custom palettes.",
  "project_state.json": "Project metadata describing features, issues, and architectural notes for the current build state."
}