{
  "backend/main.mo": "Defines backend actor with cruise deals, itineraries, reviews, bookings, branding settings, admin alerts, shareable links, and access control using several mixins and in-memory maps.",
  "feature_evidence.json": "Feature evidence report describing required update to Hero component and listing related files, components, tests, and confidence level.",
  "frontend-file-summaries.txt": "JSON-style text mapping frontend file paths to short functional descriptions of each component, hook, or config file.",
  "frontend/index.css": "Tailwind base layer defining theme variables for light and dark mode with OKLCH values and global background/foreground styling.",
  "frontend/index.html": "HTML shell containing root element and script tag loading the main React entrypoint.",
  "frontend/src/App.tsx": "Root React component that detects share links and conditionally renders either the shared itinerary page or the standard homepage layout.",
  "frontend/src/components/AdminAlertToast.tsx": "Shows toast notifications for new unviewed admin alerts when the caller is an admin.",
  "frontend/src/components/AdminDashboardDialog.tsx": "Admin dashboard dialog showing alerts, bookings, logo management, and branding settings with tabbed navigation and auto-marking alerts as viewed.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Admin settings dialog for viewing user role, principal ID, live link info, and assigning admin privileges.",
  "frontend/src/components/AppStatusLiveLinkSection.tsx": "Displays the current app URL with copy/open actions and shows backend diagnostics including version and timestamp.",
  "frontend/src/components/BookingModal.tsx": "Provides a booking dialog allowing users to select cabins, view pricing, and submit a trip reservation.",
  "frontend/src/components/CruiseCard.tsx": "Renders a cruise deal card with images, details, favorite toggling, and itinerary viewing.",
  "frontend/src/components/CruiseLineLogosManagement.tsx": "Admin interface for adding, updating, previewing, and deleting cruise line logos.",
  "frontend/src/components/CruiseLinePartners.tsx": "Displays a grid of cruise line partner logos with loading skeletons and fallback states.",
  "frontend/src/components/FavoritesDialog.tsx": "Shows a dialog listing the user’s favorite cruise deals with loading and empty states.",
  "frontend/src/components/FeaturedDeals.tsx": "Fetches and displays featured cruise deals in an auto‑advancing carousel with loading and error handling.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links, destination lists, social icons, and branding. Includes contact info and a copyright note.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, authentication handling, admin actions, and dialogs for favorites and bookings. Supports both desktop and mobile menus.",
  "frontend/src/components/Hero.tsx": "Displays a full‑screen hero section with a background image, gradient overlays, call‑to‑action buttons, and highlight stats. Handles image loading and error states.",
  "frontend/src/components/ItineraryDialog.tsx": "Shows detailed cruise itinerary info with tabs, reviews, booking actions, sharing, and PDF generation. Fetches itinerary data and manages related UI state.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter their name and saves their profile. Prevents dismissal until required info is submitted.",
  "frontend/src/components/ReviewSection.tsx": "Handles viewing, creating, editing, and deleting cruise reviews with rating controls. Uses authentication to manage user-specific review actions.",
  "frontend/src/components/SearchSection.tsx": "Search UI with filters, debounced query, and dynamic cruise deal fetching and display.",
  "frontend/src/components/SharedItineraryPage.tsx": "Renders a public itinerary page with branding, loading/error states, and itinerary details.",
  "frontend/src/components/SharedPageBrandingSettingsTab.tsx": "Admin tab for viewing, editing, and resetting shared-page branding settings.",
  "frontend/src/components/UserBookingsDialog.tsx": "Modal showing the user's bookings with status, itinerary info, and loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook that returns a debounced version of a given value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor methods for fetching and mutating cruise deals, itineraries, and filtered searches with normalization helpers.",
  "frontend/src/index.css": "Tailwind base styles and extensive theme variables defining light/dark palettes and custom ocean/sunset color utilities.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/utils/colorValidation.ts": "Utility functions for validating CSS colors, providing safe fallbacks, and applying validated color styles.",
  "frontend/src/utils/itineraryPdf.ts": "Generates a printable HTML-based PDF view of an itinerary by opening a styled print window.",
  "frontend/src/utils/sharedItineraryBranding.ts": "Merges customizable branding settings with defaults for shared itinerary pages.",
  "frontend/src/utils/urlParams.ts": "URL and sessionStorage utilities for reading, persisting, and clearing parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, plugins, and theme extensions tied to CSS variable–based color palettes.",
  "project_state.json": "Tracks project state, known issues, required images, and feature requests for fixing the homepage Hero image. Contains metadata about existing and new feature requirements for the Next Time Vacations project."
}