{
  "kind": "build_request",
  "title": "Add itinerary shareable links and PDF downloads",
  "projectName": "Next Time Vacations",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Add a shareable-link flow for itineraries that lets a user generate a public URL for a selected itinerary, and allows anyone with that URL to view the itinerary details without signing in.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-15",
          "msg-18"
        ],
        "quotes": [
          "Please allow me to send selected itineraries to a customer's email for review",
          "Please add an option to send a shareable link or a downloadable pdf of an itinerary to a client.",
          "Please add both features"
        ]
      },
      "acceptanceCriteria": [
        "From the itinerary details UI, the user can generate a shareable link for the currently viewed itinerary.",
        "The generated link is a stable URL that can be opened in a new/private browser session without authentication and still shows the itinerary details.",
        "If the share token/link is invalid or not found, the app shows an English error state indicating the shared itinerary is not available.",
        "Shareable-link generation does not require any external email service or third-party integrations."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a “Download as PDF” option for itineraries so a user can download a PDF containing the itinerary details for the currently viewed itinerary.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14",
          "msg-15",
          "msg-18"
        ],
        "quotes": [
          "Please add an option to send a shareable link or a downloadable pdf of an itinerary to a client.",
          "Sure — I can add both options.",
          "Please add both features"
        ]
      },
      "acceptanceCriteria": [
        "From the itinerary details UI, the user can trigger a PDF download for the currently viewed itinerary.",
        "The downloaded PDF includes, at minimum, the itinerary’s ports of call, departure date, return date, ship specs, cabin categories/prices/availability, dining options, and entertainment (when present).",
        "If itinerary data is unavailable, the PDF download action is disabled or shows an English error message explaining why it cannot be generated.",
        "PDF generation and download works without using any external email sending capability."
      ]
    }
  ],
  "constraints": [
    "Do not implement email sending (no outbound email integration).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add a migration file if state upgrades are required.",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding third-party email services or paid email features.",
    "Adding real-time collaboration or live updating shared itinerary pages.",
    "Adding custom branding templates beyond the existing app styling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}