{
  "kind": "build_request",
  "title": "Publish current draft to live and reduce deployment failures",
  "projectName": "Next Time Vacations",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Publish the currently deployed draft version as the public live version of the app.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-user-push-live"
        ],
        "quotes": [
          "push it live"
        ]
      },
      "acceptanceCriteria": [
        "A live (non-preview) public URL is available for the app and loads successfully.",
        "The live app renders the standard home page and can also render a shared itinerary page when opened with a valid share link parameter (e.g., ?share=<id>)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Investigate and fix any build/deploy issues that prevent the draft from successfully deploying, with the goal of making deployments reliably complete despite the known intermittent deployment failures.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-push-live",
          "msg-project-state-known-issues"
        ],
        "quotes": [
          "push it live",
          "Draft/app build intermittently fails or expires (e.g., 'draft app has expired', 'application creation unsuccessful'), requiring rebuild/retry."
        ]
      },
      "acceptanceCriteria": [
        "A clean build of the frontend succeeds without TypeScript errors.",
        "A canister build/deploy succeeds end-to-end at least twice in succession without manual intervention (i.e., no intermittent deployment failure for these attempts).",
        "If deployment still fails due to platform-side expiration, the app build process provides actionable error output identifying the failure stage (frontend build vs canister build vs deploy)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a stable-state upgrade is required.",
    "Do not edit any files under frontend/src/components/ui or the immutable hook/bootstrap paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new product features unrelated to going live (e.g., new booking flows, new admin tools).",
    "Integrating third-party hosting/deployment providers or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}