{
  "kind": "build_request",
  "title": "Add in-app Live URL and deployment diagnostics to help users go live",
  "projectName": "Next Time Vacations",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an in-app “App Status / Live Link” section that clearly shows the current app URL (derived from window.location.origin + window.location.pathname) and provides a one-click “Copy link” action, so a user can always obtain a working link without relying on any placeholder URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want my app to go live"
        ]
      },
      "acceptanceCriteria": [
        "A user can open the Admin Settings dialog and see a labeled field showing the current app URL.",
        "A “Copy link” button copies the displayed URL to the clipboard and shows a success toast.",
        "The displayed URL never uses placeholder text (e.g., https://_YOUR_APP_URL_/live) and is computed from the current browser location at runtime."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose a lightweight backend query that returns deployment diagnostics (at minimum: backend canister principal and a backend-reported timestamp/version string), and surface that information in the “App Status / Live Link” section to help confirm the live deployment is serving the expected backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want my app to go live"
        ]
      },
      "acceptanceCriteria": [
        "Backend provides a public query method that returns (a) the canister principal and (b) a backend-generated string suitable for display (e.g., last-updated timestamp or build/version identifier).",
        "Frontend calls this query via the existing actor/react-query pattern and renders the returned values in the “App Status / Live Link” section.",
        "If the diagnostics call fails, the UI shows a non-blocking error state (no app crash) with an English message indicating diagnostics could not be loaded."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a short, English “Going Live Checklist” panel in the “App Status / Live Link” section that explains how to verify the app is live (e.g., open the copied link in a private/incognito window, confirm content loads, confirm diagnostics values appear), without referencing or depending on builder UI controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want my app to go live"
        ]
      },
      "acceptanceCriteria": [
        "Checklist text is visible in the UI near the live link and is written in clear English.",
        "Checklist includes at least: incognito/private window verification, and a note that diagnostics should load if the backend is reachable.",
        "No checklist step references internal builder UI elements like a Draft/Live toolbar or a Push to Live button."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn components are read-only and must be composed).",
    "Do not edit frontend immutable hook paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if state schema upgrades are required."
  ],
  "nonGoals": [
    "Implementing or modifying the Caffeine builder/publisher UI (Draft/Live toolbar, Push to Live button) since it is not part of the app codebase.",
    "Adding third-party hosting, external databases, or non-Internet-Computer deployment targets.",
    "Adding third-party authentication (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}