{
  "kind": "build_request",
  "title": "Add reliable in-app hero image upload for the front page",
  "projectName": "Next Time Vacations",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add backend support for an admin-managed homepage hero image that can be uploaded in-app and later retrieved by the frontend (store the image as a data URL string or equivalent persisted value), with access control enforced so only admins can change it.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "i just sent you the picture again",
          "for the second time"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method to fetch the current homepage hero image (returns empty/none when not set).",
        "Backend exposes an admin-only update method to set/replace the homepage hero image value.",
        "Non-admin callers attempting to update the homepage hero image receive an authorization error.",
        "The stored homepage hero image survives canister upgrades (add migration logic only if required by existing stable state)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add frontend admin UI to upload and manage the homepage hero image from inside the app (do not rely on chat attachments), including: file picker, validation (must be an image; max 5MB), preview, save action, and a reset-to-default action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "i just sent you the picture again",
          "for the second time"
        ]
      },
      "acceptanceCriteria": [
        "An admin can open the Admin Dashboard and find a section/tab for managing the homepage hero image.",
        "Uploading a valid image shows a preview before saving.",
        "Attempting to upload a non-image file shows an English error message and does not save.",
        "Attempting to upload an image larger than 5MB shows an English error message and does not save.",
        "Saving the image triggers a success toast in English and the new image is persisted.",
        "A reset action clears the custom hero image so the app falls back to the default static hero image."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Hero component to use the admin-uploaded homepage hero image when available; otherwise fall back to the existing static asset path \"/assets/generated/cruise-ship-hero.dim_1600x900.jpg\" and keep existing load/fallback diagnostics behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "i just sent you the picture again"
        ]
      },
      "acceptanceCriteria": [
        "When a custom hero image is set, the homepage renders it as the hero background successfully without requiring a redeploy of static assets.",
        "When no custom hero image is set, the homepage continues to load the existing static hero image from \"/assets/generated/cruise-ship-hero.dim_1600x900.jpg\".",
        "If the hero image fails to load, the current on-screen diagnostics banner still appears and includes the attempted URLs/current URL as it does today."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add React Query hooks for getting and updating the homepage hero image, following existing hooks patterns used for cruise line logos (query invalidation after updates so the Hero refreshes without a hard reload).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "i just sent you the picture again"
        ]
      },
      "acceptanceCriteria": [
        "A query hook exists to fetch the current homepage hero image value and is used by the Hero/admin UI.",
        "A mutation hook exists to set/reset the homepage hero image and invalidates the relevant query keys on success.",
        "After saving a new hero image, the homepage hero updates without requiring a full page refresh."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Only generate backend/migration.mo if required to preserve existing persisted state during upgrade.",
    "Do not edit files under frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Do not implement chat-based image attachment processing.",
    "Do not add third-party image hosting or external storage services.",
    "Do not introduce additional backend canisters or databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}