{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Next Time Vacations — In-app admin-managed homepage hero image",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add admin UI in the Admin Dashboard to upload/preview/save/reset the homepage hero image with image-only + 5MB validation and English toasts/errors.",
      "acceptanceCriteria": [
        "An admin can open the Admin Dashboard and find a section/tab for managing the homepage hero image.",
        "Uploading a valid image shows a preview before saving.",
        "Attempting to upload a non-image file shows an English error message and does not save.",
        "Attempting to upload an image larger than 5MB shows an English error message and does not save.",
        "Saving the image triggers a success toast in English and the new image is persisted.",
        "A reset action clears the custom hero image so the app falls back to the default static hero image."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HomepageHeroImageManagement.tsx",
          "operation": "create",
          "description": "Create an admin-only management panel for the homepage hero image: file picker (accept image/*), validation (must be image; max 5MB), preview (data URL), Save action (calls update mutation), and Reset-to-default action (calls reset mutation). Use the existing toast system (sonner) for English success/error messages. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminDashboardDialog.tsx",
          "operation": "modify",
          "description": "Add a new Admin Dashboard tab/section for managing the homepage hero image and wire it to render the new HomepageHeroImageManagement component. Update the TabsList layout (e.g., grid columns) to include the new tab, keeping English labels. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the Hero component to prefer the admin-uploaded homepage hero image when present, otherwise use the existing static hero asset while keeping diagnostics/fallback behavior.",
      "acceptanceCriteria": [
        "When a custom hero image is set, the homepage renders it as the hero background successfully without requiring a redeploy of static assets.",
        "When no custom hero image is set, the homepage continues to load the existing static hero image from \"/assets/generated/cruise-ship-hero.dim_1600x900.jpg\".",
        "If the hero image fails to load, the current on-screen diagnostics banner still appears and includes the attempted URLs/current URL as it does today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Integrate the homepage hero image query hook and update image selection logic: when a custom image value exists, attempt to load it first; if it fails, fall back through the existing static asset fallback URLs (using the current diagnostics/attempted URL tracking and banner). When no custom value exists, keep current behavior using the static asset and existing fallback diagnostics. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add React Query hooks to fetch and update/reset the homepage hero image with query invalidation so the Hero refreshes without full reload.",
      "acceptanceCriteria": [
        "A query hook exists to fetch the current homepage hero image value and is used by the Hero/admin UI.",
        "A mutation hook exists to set/reset the homepage hero image and invalidates the relevant query keys on success.",
        "After saving a new hero image, the homepage hero updates without requiring a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks following existing patterns used for cruise line logos: (1) a query hook to fetch the current homepage hero image value, and (2) a mutation hook to set/replace and reset/clear the value. Ensure successful mutations invalidate the hero image query key so components (Hero and admin UI) update immediately without hard reload. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}