{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore homepage hero image asset and add user-visible fallback on load failure",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add the missing hero background image to the frontend public static assets at the exact required path so it is deployed and loads reliably.",
      "acceptanceCriteria": [
        "The file is present in the repo at frontend/public/assets/generated/cruise-ship-hero.dim_1600x900.jpg.",
        "Loading the homepage triggers a successful (HTTP 200) request for /assets/generated/cruise-ship-hero.dim_1600x900.jpg (no 404/failed request in browser devtools).",
        "The cruise ship image is visible as a full-viewport background in the Hero section on the homepage."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/cruise-ship-hero.dim_1600x900.jpg",
          "operation": "create",
          "description": "Add the generated cruise ship hero image asset as a committed static file so the deployed frontend can serve it at the exact public path /assets/generated/cruise-ship-hero.dim_1600x900.jpg."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve Hero image robustness by showing a user-visible message on image load failure while preserving full-viewport background behavior.",
      "acceptanceCriteria": [
        "If the hero image fails to load, the page shows the existing gradient fallback background and an English message indicating the hero image could not be loaded.",
        "If the hero image loads successfully, it displays behind the overlay as a full-viewport background (object-cover) with no layout shift or disappearance on refresh/reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Update the hero background rendering to (1) always keep a gradient layer behind the image, (2) attach onLoad/onError handlers to the rendered <img> (not just the preloader) to reliably set imageLoaded/imageError, (3) use imageLoaded to fade the image in without layout shift (e.g., opacity transition) while keeping object-cover full-viewport behavior, and (4) when imageError is true, display a small readable English message over the gradient indicating the hero image could not be loaded. Keep the image reference path exactly \"/assets/generated/cruise-ship-hero.dim_1600x900.jpg\" and do not change any files under frontend/src/components/ui."
        }
      ]
    }
  ]
}