{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore persistent full-screen cruise ship hero background on homepage",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the homepage Hero use the cruise ship image as the single full-viewport background with a graceful fallback and no post-deploy disappearance.",
      "acceptanceCriteria": [
        "On the home page (no share link present), the Hero section renders a cruise ship photo that covers the full viewport (no letterboxing) using a cover-style layout.",
        "The cruise ship image remains visible after a rebuild/redeploy (no regression where it disappears).",
        "If the cruise ship image cannot be loaded, the UI shows a graceful visual fallback (e.g., a solid/gradient background) rather than an empty/blank hero area."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Refactor Hero background rendering so the cruise ship image is the single, full-viewport (w/h) cover background for the hero area; remove/disable the competing sunset background layer; add a load-check (e.g., preloading via Image or an <img> with onError) to switch to a non-blank gradient/solid fallback when the image fails; keep existing overlays/text readability while ensuring the image is always present on the non-share homepage."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the cruise ship hero image exists as a static public asset and is referenced consistently from Hero via the exact required path.",
      "acceptanceCriteria": [
        "The file frontend/public/assets/generated/cruise-ship-hero.dim_1600x900.jpg exists in the project and is served by the frontend.",
        "The Hero component uses /assets/generated/cruise-ship-hero.dim_1600x900.jpg as the background source (no broken links / 404s in browser devtools)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/cruise-ship-hero.dim_1600x900.jpg",
          "operation": "create",
          "description": "Add/commit the generated static hero image asset at this exact path so it is bundled and served reliably across rebuilds/redeploys."
        },
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Update Hero to reference the cruise ship hero asset using the exact required public path /assets/generated/cruise-ship-hero.dim_1600x900.jpg (centralize into a single constant to avoid regressions and inconsistent paths)."
        }
      ]
    }
  ]
}