{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "In-app Live Link and Deployment Diagnostics in Admin Settings",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show a runtime-derived live app URL in Admin Settings with one-click copy and success toast.",
      "acceptanceCriteria": [
        "A user can open the Admin Settings dialog and see a labeled field showing the current app URL.",
        "A “Copy link” button copies the displayed URL to the clipboard and shows a success toast.",
        "The displayed URL never uses placeholder text (e.g., https://_YOUR_APP_URL_/live) and is computed from the current browser location at runtime."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppStatusLiveLinkSection.tsx",
          "operation": "create",
          "description": "Create an \"App Status / Live Link\" UI section component that computes the current app URL at runtime from window.location.origin + window.location.pathname, displays it in a labeled read-only field, and provides a \"Copy link\" action that writes to navigator.clipboard and shows a success toast via the existing sonner toast usage."
        },
        {
          "path": "frontend/src/components/AdminSettingsDialog.tsx",
          "operation": "modify",
          "description": "Compose (do not modify) existing shadcn/ui components to render the new AppStatusLiveLinkSection within the Admin Settings dialog so users can always find and copy the current live URL."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fetch and display backend deployment diagnostics in the App Status / Live Link section with graceful error handling.",
      "acceptanceCriteria": [
        "Backend provides a public query method that returns (a) the canister principal and (b) a backend-generated string suitable for display (e.g., last-updated timestamp or build/version identifier).",
        "Frontend calls this query via the existing actor/react-query pattern and renders the returned values in the “App Status / Live Link” section.",
        "If the diagnostics call fails, the UI shows a non-blocking error state (no app crash) with an English message indicating diagnostics could not be loaded."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new react-query hook (using the existing actor/react-query pattern) to query backend diagnostics via the existing actor method getBackendDiagnostics(), with safe defaults and non-throwing behavior suitable for UI rendering."
        },
        {
          "path": "frontend/src/components/AppStatusLiveLinkSection.tsx",
          "operation": "modify",
          "description": "Use the new diagnostics query hook to render deployment diagnostics values in the \"App Status / Live Link\" section; include a non-blocking error UI state with an English message (e.g., \"Diagnostics could not be loaded\") when the diagnostics query fails."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an English Going Live Checklist panel near the live link with practical verification steps.",
      "acceptanceCriteria": [
        "Checklist text is visible in the UI near the live link and is written in clear English.",
        "Checklist includes at least: incognito/private window verification, and a note that diagnostics should load if the backend is reachable.",
        "No checklist step references internal builder UI elements like a Draft/Live toolbar or a Push to Live button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppStatusLiveLinkSection.tsx",
          "operation": "modify",
          "description": "Add a \"Going Live Checklist\" panel within the \"App Status / Live Link\" section containing clear English steps (including incognito/private window verification and a note that diagnostics should load if the backend is reachable) without referencing any builder/publisher controls."
        }
      ]
    }
  ]
}